# EndPoly3D

## Description
Procedure EndPoly3D completes the definition of a multiple extrude object within a VectorWorks document. On calling EndPoly3D, the object is created in the document from the preceding object creation calls.

It is recommended to call ResetOrientation3D after 3D object creations in order to ensure that the new 3D objects will draw properly.

```pascal
PROCEDURE EndPoly3D;
```

```python
def vs.EndPoly3D():
    return None
```

## Remarks
[sd 8/14/98]

## Examples
#### VectorScript ####
```pascal
BeginPoly3D;
Add3DPt(0,0,0);
Add3DPt(2,0,0);
Add3DPt(2,2,0);
Add3DPt(1,3,0);
Add3DPt(0,2,0);
Add3DPt(0,0,0);
EndPoly3D;
```
#### Python ####
```python
vs.BeginPoly3D()
vs.Add3DPt(0,0,0)
vs.Add3DPt(2,0,0)
vs.Add3DPt(2,2,0)
vs.Add3DPt(1,3,0)
vs.Add3DPt(0,2,0)
vs.Add3DPt(0,0,0)
vs.EndPoly3D()
```

```pascal
EndPoly3D;
```
```python
vs.EndPoly3D()
vs.SetPadAttrs( vs.LNewObj() )

vs.Add3DPt( length, width + vs.PCurb_Width + gDTM, vs.PRise )
vs.Add3DPt( length, -( width + vs.PCurb_Width + gDTM ), vs.PRise )
vs.Add3DPt( 0, -( width + vs.PCurb_Width + gDTM ), 0 )
vs.EndPoly3D()
vs.SetPadAttrs( vs.LNewObj() )

vs.Add3DPt( vs.PThroat_Width + vs.PCurb_Width, 0, vs.PRise )
vs.EndPoly3D()
vs.HMoveBackward( vs.LNewObj(), True )
vs.SetPadAttrs( vs.LNewObj() )
```

## See Also
VS Functions:
BeginPoly3D
| Add3DPt

## Version
Availability: from All Versions

## Category
* Objects - 3D